<a href="https://colab.research.google.com/github/mehrishka177/Codingal--Poopypoop177/blob/main/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
-- Create tables for employees, departments, and salaries
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(100)
);

CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(100),
    department_id INT,
    salary INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

CREATE TABLE salaries (
    employee_id INT,
    salary_amount INT,
    FOREIGN KEY (employee_id) REFERENCES employees(employee_id)
);

-- Insert sample data into the departments table
INSERT INTO departments (department_id, department_name)
VALUES
    (1, 'Sales'),
    (2, 'Marketing'),
    (3, 'HR');

-- Insert sample data into the employees table
INSERT INTO employees (employee_id, employee_name, department_id, salary)
VALUES
    (1, 'John Doe', 1, 50000),
    (2, 'Jane Smith', 1, 60000),
    (3, 'Sam Green', 2, 55000),
    (4, 'Alex Brown', 2, 70000),
    (5, 'Emily White', 3, 65000);

-- Insert sample data into the salaries table
INSERT INTO salaries (employee_id, salary_amount)
VALUES
    (1, 50000),
    (2, 60000),
    (3, 55000),
    (4, 70000),
    (5, 65000);

-- Query to find employees who earn more than the average salary in their department
SELECT e.employee_id, e.employee_name, e.salary, d.department_name
FROM employees e
JOIN departments d ON e.department_id = d.department_id
WHERE e.salary > (
    -- Subquery to calculate the average salary in each department
    SELECT AVG(s.salary_amount)
    FROM salaries s
    WHERE s.employee_id = e.employee_id
    GROUP BY e.department_id
)
ORDER BY d.department_name, e.salary DESC;